In [1]:
import pandas as pd
from hdfs import Client
tclient = Client( 'http://localhost:50070')
with tclient.read('/data/cities.csv', encoding='utf-8') as reader:
  df=pd.read_csv(reader)

In [2]:
df.head()

  code      city      country    lat     lon
0  ZNZ  ZANZIBAR     TANZANIA  -6.13   39.31
1  TYO     TOKYO        JAPAN  35.68  139.76
2  AKL  AUCKLAND  NEW ZEALAND -36.85  174.78
3  BKK   BANGKOK     THAILAND  13.75  100.48
4  DEL     DELHI        INDIA  29.01   77.38